app/controllers/users_controller.rb

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "introduction" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", ""], ["profile_image_id", "0833312bd3230027372157bc76e461aa221e71d840a4d8727669449adefd"], ["updated_at", "2021-02-03 04:05:52.502771"], ["id", 2]]